app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Test"], ["room_number", 1]]
---
    def create
        @school_class = SchoolClass.new(schoolclass_params(:title, :room_number))
        @school_class.save